---
kind: method
id: M:Autodesk.Revit.DB.FilteredElementCollector.Dispose
zh: 筛选、过滤
source: html/c23c8781-f645-c059-7db5-d0cfd732dda1.htm
---
# Autodesk.Revit.DB.FilteredElementCollector.Dispose Method

**中文**: 筛选、过滤

Releases all resources used by the FilteredElementCollector

## Syntax (C#)
```csharp
public void Dispose()
```